     hCopyright('v2.7.0 - Copyright (c) 2012-2015 iSphere Project Team')

      /if defined(VERSION_INFO)
     D ISPHERE_SERVER_VERSION...
     D                 c                   '2.7.0'
     D ISPHERE_MIN_CLIENT_VERSION...
     D                 c                   '2.7.0'

     D ISPHERE_DATE...
     D                 c                   '09.07.2015'
      /endif

