     hCopyright('(C) Copyright iSphere Project Owners')

      /if defined(VERSION_INFO)
     D ISPHERE_SERVER_VERSION...
     D                 c                   '2.1.0'
     D ISPHERE_MIN_CLIENT_VERSION...
     D                 c                   '2.1.0'

     D ISPHERE_DATE...
     D                 c                   '21.06.2014'
      /endif

